Tekla Open API Reference for Tekla Structures 2025
Position Constructor
 Creates a new position instance.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Position()
Public Sub New
See Also
Reference
Position Class
Tekla.Structures.Model Namespace